app/Controllers/Main.php

SELECT *
FROM `tasks`
WHERE `id_user` = '3'
---

        // load task from database and the user in session
        $task_model = new TasksModel();
        $data['tasks'] = $task_model->where('id_user', session()->id)->findAll();

SELECT *
FROM `tasks`
WHERE `id` = '7'
 LIMIT 1
---
    public function edit_task($enc_id)
    {
        // decrypt task id
        $task_id = decrypt($enc_id);
        if (!$task_id) {
            return redirect()->to('/');
        }

        $data = [];

        // check for validation errors
        $validation_errors = session()->getFlashdata('validation_errors');
        if ($validation_errors) {
            $data['validation_errors'] = $validation_errors;
        }

        // load task data
        $tasks_model = new TasksModel();
        $task_data = $tasks_model->where('id', $task_id)->first();

SELECT *
FROM `tasks`
WHERE `id` = '3'
 LIMIT 1
---

        // load task data
        $tasks_model = new TasksModel();
        $task_data = $tasks_model->where('id', $task_id)->first();

UPDATE `tasks` SET `task_name` = 'Task 3 - editado', `task_description` = 'Description of Task 3 - editado', `task_status` = 'started', `updated_at` = '2025-04-23 14:08:24'
WHERE `tasks`.`id` IN ('3')
---
        }

        // update task in database
        $tasks_model->update(
            $task_id,
            [
                'task_name' => $tarefa,
                'task_description' => $descricao,
                'task_status' => $status
            ]
        );

SELECT *
FROM `tasks`
WHERE `id` = '3'
 LIMIT 1
---
    public function delete_task($enc_id)
    {

        // decrypt task id
        $task_id = decrypt($enc_id);
        if (!$task_id) {
            return redirect()->to('/');
        }

        // load task data
        $tasks_model = new TasksModel();
        $task_data = $tasks_model->where('id', $task_id)->first();

SELECT *
FROM `tasks`
WHERE `id` = '14'
 LIMIT 1
DELETE FROM `tasks`
WHERE `id` IN ('14')
---
    public function delete_task_confirm($enc_id)
    {

        // decrypt task id
        $task_id = decrypt($enc_id);
        if (!$task_id) {
            return redirect()->to('/');
        }

        // load task data
        $tasks_model = new TasksModel();
        $task_data = $tasks_model->where('id', $task_id)->first();
        if (!$task_data) {
            return redirect()->to('/');
        }

        // check if the task belongs to the user in session
        if ($task_data->id_user != session()->id) {
            return redirect()->to('/');
        }

        // delete task in database
        $tasks_model->delete($task_id);